Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.130/PIC32CK-SG00/include/component/sdmmc.h
/* -------- SDMMC_ACESR : (SDMMC Offset: 0x3C) ( R/ 16) Auto CMD Error Status -------- */
#define SDMMC_ACESR_RESETVALUE                _UINT16_(0x00)                                       /*  (SDMMC_ACESR) Auto CMD Error Status  Reset Value */

#define SDMMC_ACESR_ACMD12NE_Pos              _UINT16_(0)                                          /* (SDMMC_ACESR) Auto CMD12 Not Executed Position */
#define SDMMC_ACESR_ACMD12NE_Msk              (_UINT16_(0x1) << SDMMC_ACESR_ACMD12NE_Pos)          /* (SDMMC_ACESR) Auto CMD12 Not Executed Mask */
#define SDMMC_ACESR_ACMD12NE(value)           (SDMMC_ACESR_ACMD12NE_Msk & (_UINT16_(value) << SDMMC_ACESR_ACMD12NE_Pos)) /* Assigment of value for ACMD12NE in the SDMMC_ACESR register */
#define   SDMMC_ACESR_ACMD12NE_EXEC_Val       _UINT16_(0x0)                                        /* (SDMMC_ACESR) Executed  */
#define   SDMMC_ACESR_ACMD12NE_NOT_EXEC_Val   _UINT16_(0x1)                                        /* (SDMMC_ACESR) Not executed  */
#define SDMMC_ACESR_ACMD12NE_EXEC             (SDMMC_ACESR_ACMD12NE_EXEC_Val << SDMMC_ACESR_ACMD12NE_Pos) /* (SDMMC_ACESR) Executed Position  */
#define SDMMC_ACESR_ACMD12NE_NOT_EXEC         (SDMMC_ACESR_ACMD12NE_NOT_EXEC_Val << SDMMC_ACESR_ACMD12NE_Pos) /* (SDMMC_ACESR) Not executed Position  */
#define SDMMC_ACESR_ACMDTEO_Pos               _UINT16_(1)                                          /* (SDMMC_ACESR) Auto CMD Timeout Error Position */
#define SDMMC_ACESR_ACMDTEO_Msk               (_UINT16_(0x1) << SDMMC_ACESR_ACMDTEO_Pos)           /* (SDMMC_ACESR) Auto CMD Timeout Error Mask */
#define SDMMC_ACESR_ACMDTEO(value)            (SDMMC_ACESR_ACMDTEO_Msk & (_UINT16_(value) << SDMMC_ACESR_ACMDTEO_Pos)) /* Assigment of value for ACMDTEO in the SDMMC_ACESR register */
#define   SDMMC_ACESR_ACMDTEO_NO_Val          _UINT16_(0x0)                                        /* (SDMMC_ACESR) No error  */
#define   SDMMC_ACESR_ACMDTEO_YES_Val         _UINT16_(0x1)                                        /* (SDMMC_ACESR) Timeout  */
#define SDMMC_ACESR_ACMDTEO_NO                (SDMMC_ACESR_ACMDTEO_NO_Val << SDMMC_ACESR_ACMDTEO_Pos) /* (SDMMC_ACESR) No error Position  */
#define SDMMC_ACESR_ACMDTEO_YES               (SDMMC_ACESR_ACMDTEO_YES_Val << SDMMC_ACESR_ACMDTEO_Pos) /* (SDMMC_ACESR) Timeout Position  */
#define SDMMC_ACESR_ACMDCRC_Pos               _UINT16_(2)                                          /* (SDMMC_ACESR) Auto CMD CRC Error Position */
#define SDMMC_ACESR_ACMDCRC_Msk               (_UINT16_(0x1) << SDMMC_ACESR_ACMDCRC_Pos)           /* (SDMMC_ACESR) Auto CMD CRC Error Mask */
#define SDMMC_ACESR_ACMDCRC(value)            (SDMMC_ACESR_ACMDCRC_Msk & (_UINT16_(value) << SDMMC_ACESR_ACMDCRC_Pos)) /* Assigment of value for ACMDCRC in the SDMMC_ACESR register */
#define   SDMMC_ACESR_ACMDCRC_NO_Val          _UINT16_(0x0)                                        /* (SDMMC_ACESR) No error  */
#define   SDMMC_ACESR_ACMDCRC_YES_Val         _UINT16_(0x1)                                        /* (SDMMC_ACESR) CRC Error Generated  */
#define SDMMC_ACESR_ACMDCRC_NO                (SDMMC_ACESR_ACMDCRC_NO_Val << SDMMC_ACESR_ACMDCRC_Pos) /* (SDMMC_ACESR) No error Position  */
#define SDMMC_ACESR_ACMDCRC_YES               (SDMMC_ACESR_ACMDCRC_YES_Val << SDMMC_ACESR_ACMDCRC_Pos) /* (SDMMC_ACESR) CRC Error Generated Position  */
#define SDMMC_ACESR_ACMDEND_Pos               _UINT16_(3)                                          /* (SDMMC_ACESR) Auto CMD End Bit Error Position */
#define SDMMC_ACESR_ACMDEND_Msk               (_UINT16_(0x1) << SDMMC_ACESR_ACMDEND_Pos)           /* (SDMMC_ACESR) Auto CMD End Bit Error Mask */
#define SDMMC_ACESR_ACMDEND(value)            (SDMMC_ACESR_ACMDEND_Msk & (_UINT16_(value) << SDMMC_ACESR_ACMDEND_Pos)) /* Assigment of value for ACMDEND in the SDMMC_ACESR register */
#define   SDMMC_ACESR_ACMDEND_NO_Val          _UINT16_(0x0)                                        /* (SDMMC_ACESR) No error  */
#define   SDMMC_ACESR_ACMDEND_YES_Val         _UINT16_(0x1)                                        /* (SDMMC_ACESR) End Bit Error Generated  */
#define SDMMC_ACESR_ACMDEND_NO                (SDMMC_ACESR_ACMDEND_NO_Val << SDMMC_ACESR_ACMDEND_Pos) /* (SDMMC_ACESR) No error Position  */
#define SDMMC_ACESR_ACMDEND_YES               (SDMMC_ACESR_ACMDEND_YES_Val << SDMMC_ACESR_ACMDEND_Pos) /* (SDMMC_ACESR) End Bit Error Generated Position  */
#define SDMMC_ACESR_ACMDIDX_Pos               _UINT16_(4)                                          /* (SDMMC_ACESR) Auto CMD Index Error Position */
#define SDMMC_ACESR_ACMDIDX_Msk               (_UINT16_(0x1) << SDMMC_ACESR_ACMDIDX_Pos)           /* (SDMMC_ACESR) Auto CMD Index Error Mask */
#define SDMMC_ACESR_ACMDIDX(value)            (SDMMC_ACESR_ACMDIDX_Msk & (_UINT16_(value) << SDMMC_ACESR_ACMDIDX_Pos)) /* Assigment of value for ACMDIDX in the SDMMC_ACESR register */
#define   SDMMC_ACESR_ACMDIDX_NO_Val          _UINT16_(0x0)                                        /* (SDMMC_ACESR) No error  */
#define   SDMMC_ACESR_ACMDIDX_YES_Val         _UINT16_(0x1)                                        /* (SDMMC_ACESR) Error  */
#define SDMMC_ACESR_ACMDIDX_NO                (SDMMC_ACESR_ACMDIDX_NO_Val << SDMMC_ACESR_ACMDIDX_Pos) /* (SDMMC_ACESR) No error Position  */
#define SDMMC_ACESR_ACMDIDX_YES               (SDMMC_ACESR_ACMDIDX_YES_Val << SDMMC_ACESR_ACMDIDX_Pos) /* (SDMMC_ACESR) Error Position  */
#define SDMMC_ACESR_CMDNI_Pos                 _UINT16_(7)                                          /* (SDMMC_ACESR) Command not Issued By Auto CMD12 Error Position */
#define SDMMC_ACESR_CMDNI_Msk                 (_UINT16_(0x1) << SDMMC_ACESR_CMDNI_Pos)             /* (SDMMC_ACESR) Command not Issued By Auto CMD12 Error Mask */
#define SDMMC_ACESR_CMDNI(value)              (SDMMC_ACESR_CMDNI_Msk & (_UINT16_(value) << SDMMC_ACESR_CMDNI_Pos)) /* Assigment of value for CMDNI in the SDMMC_ACESR register */
#define   SDMMC_ACESR_CMDNI_OK_Val            _UINT16_(0x0)                                        /* (SDMMC_ACESR) No error  */
#define   SDMMC_ACESR_CMDNI_NOT_ISSUED_Val    _UINT16_(0x1)                                        /* (SDMMC_ACESR) Not Issued  */
#define SDMMC_ACESR_CMDNI_OK                  (SDMMC_ACESR_CMDNI_OK_Val << SDMMC_ACESR_CMDNI_Pos)  /* (SDMMC_ACESR) No error Position  */
#define SDMMC_ACESR_CMDNI_NOT_ISSUED          (SDMMC_ACESR_CMDNI_NOT_ISSUED_Val << SDMMC_ACESR_CMDNI_Pos) /* (SDMMC_ACESR) Not Issued Position  */
#define SDMMC_ACESR_Msk                       _UINT16_(0x009F)                                     /* (SDMMC_ACESR) Register Mask  */


/* -------- SDMMC_HC2R : (SDMMC Offset: 0x3E) (R/W 16) Host Control 2 -------- */
#define SDMMC_HC2R_RESETVALUE                 _UINT16_(0x00)                                       /*  (SDMMC_HC2R) Host Control 2  Reset Value */

