Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.130/PIC32CK-SG00/include/component/sdmmc.h
#define SDMMC_HC2R_UHSMS_Pos                  _UINT16_(0)                                          /* (SDMMC_HC2R) UHS Mode Select Position */
#define SDMMC_HC2R_UHSMS_Msk                  (_UINT16_(0x7) << SDMMC_HC2R_UHSMS_Pos)              /* (SDMMC_HC2R) UHS Mode Select Mask */
#define SDMMC_HC2R_UHSMS(value)               (SDMMC_HC2R_UHSMS_Msk & (_UINT16_(value) << SDMMC_HC2R_UHSMS_Pos)) /* Assigment of value for UHSMS in the SDMMC_HC2R register */
#define   SDMMC_HC2R_UHSMS_SDR12_Val          _UINT16_(0x0)                                        /* (SDMMC_HC2R) SDR12  */
#define   SDMMC_HC2R_UHSMS_SDR25_Val          _UINT16_(0x1)                                        /* (SDMMC_HC2R) SDR25  */
#define   SDMMC_HC2R_UHSMS_SDR50_Val          _UINT16_(0x2)                                        /* (SDMMC_HC2R) SDR50  */
#define   SDMMC_HC2R_UHSMS_SDR104_Val         _UINT16_(0x3)                                        /* (SDMMC_HC2R) SDR104  */
#define   SDMMC_HC2R_UHSMS_DDR50_Val          _UINT16_(0x4)                                        /* (SDMMC_HC2R) DDR50  */
#define SDMMC_HC2R_UHSMS_SDR12                (SDMMC_HC2R_UHSMS_SDR12_Val << SDMMC_HC2R_UHSMS_Pos) /* (SDMMC_HC2R) SDR12 Position  */
#define SDMMC_HC2R_UHSMS_SDR25                (SDMMC_HC2R_UHSMS_SDR25_Val << SDMMC_HC2R_UHSMS_Pos) /* (SDMMC_HC2R) SDR25 Position  */
#define SDMMC_HC2R_UHSMS_SDR50                (SDMMC_HC2R_UHSMS_SDR50_Val << SDMMC_HC2R_UHSMS_Pos) /* (SDMMC_HC2R) SDR50 Position  */
#define SDMMC_HC2R_UHSMS_SDR104               (SDMMC_HC2R_UHSMS_SDR104_Val << SDMMC_HC2R_UHSMS_Pos) /* (SDMMC_HC2R) SDR104 Position  */
#define SDMMC_HC2R_UHSMS_DDR50                (SDMMC_HC2R_UHSMS_DDR50_Val << SDMMC_HC2R_UHSMS_Pos) /* (SDMMC_HC2R) DDR50 Position  */
#define SDMMC_HC2R_VS18EN_Pos                 _UINT16_(3)                                          /* (SDMMC_HC2R) 1.8V Signaling Enable Position */
#define SDMMC_HC2R_VS18EN_Msk                 (_UINT16_(0x1) << SDMMC_HC2R_VS18EN_Pos)             /* (SDMMC_HC2R) 1.8V Signaling Enable Mask */
#define SDMMC_HC2R_VS18EN(value)              (SDMMC_HC2R_VS18EN_Msk & (_UINT16_(value) << SDMMC_HC2R_VS18EN_Pos)) /* Assigment of value for VS18EN in the SDMMC_HC2R register */
#define   SDMMC_HC2R_VS18EN_S33V_Val          _UINT16_(0x0)                                        /* (SDMMC_HC2R) 3.3V Signaling  */
#define   SDMMC_HC2R_VS18EN_S18V_Val          _UINT16_(0x1)                                        /* (SDMMC_HC2R) 1.8V Signaling  */
#define SDMMC_HC2R_VS18EN_S33V                (SDMMC_HC2R_VS18EN_S33V_Val << SDMMC_HC2R_VS18EN_Pos) /* (SDMMC_HC2R) 3.3V Signaling Position  */
#define SDMMC_HC2R_VS18EN_S18V                (SDMMC_HC2R_VS18EN_S18V_Val << SDMMC_HC2R_VS18EN_Pos) /* (SDMMC_HC2R) 1.8V Signaling Position  */
#define SDMMC_HC2R_DRVSEL_Pos                 _UINT16_(4)                                          /* (SDMMC_HC2R) Driver Strength Select Position */
#define SDMMC_HC2R_DRVSEL_Msk                 (_UINT16_(0x3) << SDMMC_HC2R_DRVSEL_Pos)             /* (SDMMC_HC2R) Driver Strength Select Mask */
#define SDMMC_HC2R_DRVSEL(value)              (SDMMC_HC2R_DRVSEL_Msk & (_UINT16_(value) << SDMMC_HC2R_DRVSEL_Pos)) /* Assigment of value for DRVSEL in the SDMMC_HC2R register */
#define   SDMMC_HC2R_DRVSEL_B_Val             _UINT16_(0x0)                                        /* (SDMMC_HC2R) Driver Type B is Selected (Default)  */
#define   SDMMC_HC2R_DRVSEL_A_Val             _UINT16_(0x1)                                        /* (SDMMC_HC2R) Driver Type A is Selected  */
#define   SDMMC_HC2R_DRVSEL_C_Val             _UINT16_(0x2)                                        /* (SDMMC_HC2R) Driver Type C is Selected  */
#define   SDMMC_HC2R_DRVSEL_D_Val             _UINT16_(0x3)                                        /* (SDMMC_HC2R) Driver Type D is Selected  */
#define SDMMC_HC2R_DRVSEL_B                   (SDMMC_HC2R_DRVSEL_B_Val << SDMMC_HC2R_DRVSEL_Pos)   /* (SDMMC_HC2R) Driver Type B is Selected (Default) Position  */
#define SDMMC_HC2R_DRVSEL_A                   (SDMMC_HC2R_DRVSEL_A_Val << SDMMC_HC2R_DRVSEL_Pos)   /* (SDMMC_HC2R) Driver Type A is Selected Position  */
#define SDMMC_HC2R_DRVSEL_C                   (SDMMC_HC2R_DRVSEL_C_Val << SDMMC_HC2R_DRVSEL_Pos)   /* (SDMMC_HC2R) Driver Type C is Selected Position  */
#define SDMMC_HC2R_DRVSEL_D                   (SDMMC_HC2R_DRVSEL_D_Val << SDMMC_HC2R_DRVSEL_Pos)   /* (SDMMC_HC2R) Driver Type D is Selected Position  */
#define SDMMC_HC2R_EXTUN_Pos                  _UINT16_(6)                                          /* (SDMMC_HC2R) Execute Tuning Position */
#define SDMMC_HC2R_EXTUN_Msk                  (_UINT16_(0x1) << SDMMC_HC2R_EXTUN_Pos)              /* (SDMMC_HC2R) Execute Tuning Mask */
#define SDMMC_HC2R_EXTUN(value)               (SDMMC_HC2R_EXTUN_Msk & (_UINT16_(value) << SDMMC_HC2R_EXTUN_Pos)) /* Assigment of value for EXTUN in the SDMMC_HC2R register */
#define   SDMMC_HC2R_EXTUN_NO_Val             _UINT16_(0x0)                                        /* (SDMMC_HC2R) Not Tuned or Tuning Completed  */
#define   SDMMC_HC2R_EXTUN_REQUESTED_Val      _UINT16_(0x1)                                        /* (SDMMC_HC2R) Execute Tuning  */
#define SDMMC_HC2R_EXTUN_NO                   (SDMMC_HC2R_EXTUN_NO_Val << SDMMC_HC2R_EXTUN_Pos)    /* (SDMMC_HC2R) Not Tuned or Tuning Completed Position  */
#define SDMMC_HC2R_EXTUN_REQUESTED            (SDMMC_HC2R_EXTUN_REQUESTED_Val << SDMMC_HC2R_EXTUN_Pos) /* (SDMMC_HC2R) Execute Tuning Position  */
#define SDMMC_HC2R_SLCKSEL_Pos                _UINT16_(7)                                          /* (SDMMC_HC2R) Sampling Clock Select Position */
#define SDMMC_HC2R_SLCKSEL_Msk                (_UINT16_(0x1) << SDMMC_HC2R_SLCKSEL_Pos)            /* (SDMMC_HC2R) Sampling Clock Select Mask */
#define SDMMC_HC2R_SLCKSEL(value)             (SDMMC_HC2R_SLCKSEL_Msk & (_UINT16_(value) << SDMMC_HC2R_SLCKSEL_Pos)) /* Assigment of value for SLCKSEL in the SDMMC_HC2R register */
#define   SDMMC_HC2R_SLCKSEL_FIXED_Val        _UINT16_(0x0)                                        /* (SDMMC_HC2R) Fixed clock is used to sample data  */
#define   SDMMC_HC2R_SLCKSEL_TUNED_Val        _UINT16_(0x1)                                        /* (SDMMC_HC2R) Tuned clock is used to sample data  */
#define SDMMC_HC2R_SLCKSEL_FIXED              (SDMMC_HC2R_SLCKSEL_FIXED_Val << SDMMC_HC2R_SLCKSEL_Pos) /* (SDMMC_HC2R) Fixed clock is used to sample data Position  */
#define SDMMC_HC2R_SLCKSEL_TUNED              (SDMMC_HC2R_SLCKSEL_TUNED_Val << SDMMC_HC2R_SLCKSEL_Pos) /* (SDMMC_HC2R) Tuned clock is used to sample data Position  */
#define SDMMC_HC2R_ASINTEN_Pos                _UINT16_(14)                                         /* (SDMMC_HC2R) Asynchronous Interrupt Enable Position */
#define SDMMC_HC2R_ASINTEN_Msk                (_UINT16_(0x1) << SDMMC_HC2R_ASINTEN_Pos)            /* (SDMMC_HC2R) Asynchronous Interrupt Enable Mask */
#define SDMMC_HC2R_ASINTEN(value)             (SDMMC_HC2R_ASINTEN_Msk & (_UINT16_(value) << SDMMC_HC2R_ASINTEN_Pos)) /* Assigment of value for ASINTEN in the SDMMC_HC2R register */
#define   SDMMC_HC2R_ASINTEN_DISABLED_Val     _UINT16_(0x0)                                        /* (SDMMC_HC2R) Disabled  */
#define   SDMMC_HC2R_ASINTEN_ENABLED_Val      _UINT16_(0x1)                                        /* (SDMMC_HC2R) Enabled  */
#define SDMMC_HC2R_ASINTEN_DISABLED           (SDMMC_HC2R_ASINTEN_DISABLED_Val << SDMMC_HC2R_ASINTEN_Pos) /* (SDMMC_HC2R) Disabled Position  */
#define SDMMC_HC2R_ASINTEN_ENABLED            (SDMMC_HC2R_ASINTEN_ENABLED_Val << SDMMC_HC2R_ASINTEN_Pos) /* (SDMMC_HC2R) Enabled Position  */
#define SDMMC_HC2R_PVALEN_Pos                 _UINT16_(15)                                         /* (SDMMC_HC2R) Preset Value Enable Position */
#define SDMMC_HC2R_PVALEN_Msk                 (_UINT16_(0x1) << SDMMC_HC2R_PVALEN_Pos)             /* (SDMMC_HC2R) Preset Value Enable Mask */
#define SDMMC_HC2R_PVALEN(value)              (SDMMC_HC2R_PVALEN_Msk & (_UINT16_(value) << SDMMC_HC2R_PVALEN_Pos)) /* Assigment of value for PVALEN in the SDMMC_HC2R register */
#define   SDMMC_HC2R_PVALEN_HOST_Val          _UINT16_(0x0)                                        /* (SDMMC_HC2R) SDCLK and Driver Strength are controlled by Host Controller  */
#define   SDMMC_HC2R_PVALEN_AUTO_Val          _UINT16_(0x1)                                        /* (SDMMC_HC2R) Automatic Selection by Preset Value is Enabled  */
#define SDMMC_HC2R_PVALEN_HOST                (SDMMC_HC2R_PVALEN_HOST_Val << SDMMC_HC2R_PVALEN_Pos) /* (SDMMC_HC2R) SDCLK and Driver Strength are controlled by Host Controller Position  */
#define SDMMC_HC2R_PVALEN_AUTO                (SDMMC_HC2R_PVALEN_AUTO_Val << SDMMC_HC2R_PVALEN_Pos) /* (SDMMC_HC2R) Automatic Selection by Preset Value is Enabled Position  */
#define SDMMC_HC2R_Msk                        _UINT16_(0xC0FF)                                     /* (SDMMC_HC2R) Register Mask  */

/* EMMC mode */
#define SDMMC_HC2R_EMMC_HS200EN_Pos           _UINT16_(0)                                          /* (SDMMC_HC2R) HS200 Mode Enable Position */
#define SDMMC_HC2R_EMMC_HS200EN_Msk           (_UINT16_(0xF) << SDMMC_HC2R_EMMC_HS200EN_Pos)       /* (SDMMC_HC2R) HS200 Mode Enable Mask */
#define SDMMC_HC2R_EMMC_HS200EN(value)        (SDMMC_HC2R_EMMC_HS200EN_Msk & (_UINT16_(value) << SDMMC_HC2R_EMMC_HS200EN_Pos))
#define   SDMMC_HC2R_EMMC_HS200EN_SDR12_Val   _UINT16_(0x0)                                        /* (SDMMC_HC2R) SDR12  */
#define   SDMMC_HC2R_EMMC_HS200EN_SDR25_Val   _UINT16_(0x1)                                        /* (SDMMC_HC2R) SDR25  */
#define   SDMMC_HC2R_EMMC_HS200EN_SDR50_Val   _UINT16_(0x2)                                        /* (SDMMC_HC2R) SDR50  */
#define   SDMMC_HC2R_EMMC_HS200EN_SDR104_Val  _UINT16_(0x3)                                        /* (SDMMC_HC2R) SDR104  */
#define   SDMMC_HC2R_EMMC_HS200EN_DDR50_Val   _UINT16_(0x4)                                        /* (SDMMC_HC2R) DDR50  */
#define SDMMC_HC2R_EMMC_HS200EN_SDR12         (SDMMC_HC2R_EMMC_HS200EN_SDR12_Val << SDMMC_HC2R_EMMC_HS200EN_Pos) /* (SDMMC_HC2R) SDR12 Position  */
#define SDMMC_HC2R_EMMC_HS200EN_SDR25         (SDMMC_HC2R_EMMC_HS200EN_SDR25_Val << SDMMC_HC2R_EMMC_HS200EN_Pos) /* (SDMMC_HC2R) SDR25 Position  */
#define SDMMC_HC2R_EMMC_HS200EN_SDR50         (SDMMC_HC2R_EMMC_HS200EN_SDR50_Val << SDMMC_HC2R_EMMC_HS200EN_Pos) /* (SDMMC_HC2R) SDR50 Position  */
#define SDMMC_HC2R_EMMC_HS200EN_SDR104        (SDMMC_HC2R_EMMC_HS200EN_SDR104_Val << SDMMC_HC2R_EMMC_HS200EN_Pos) /* (SDMMC_HC2R) SDR104 Position  */
#define SDMMC_HC2R_EMMC_HS200EN_DDR50         (SDMMC_HC2R_EMMC_HS200EN_DDR50_Val << SDMMC_HC2R_EMMC_HS200EN_Pos) /* (SDMMC_HC2R) DDR50 Position  */
#define SDMMC_HC2R_EMMC_Msk                   _UINT16_(0x000F)                                      /* (SDMMC_HC2R_EMMC) Register Mask  */


/* -------- SDMMC_CA0R : (SDMMC Offset: 0x40) (R/W 32) Capabilities 0 -------- */
#define SDMMC_CA0R_RESETVALUE                 _UINT32_(0x27E8008C)                                 /*  (SDMMC_CA0R) Capabilities 0  Reset Value */

