Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.130/PIC32CK-SG00/include/component/sdmmc.h
#define SDMMC_CA0R_TEOCLKF_Pos                _UINT32_(0)                                          /* (SDMMC_CA0R) Timeout Clock Frequency Position */
#define SDMMC_CA0R_TEOCLKF_Msk                (_UINT32_(0x3F) << SDMMC_CA0R_TEOCLKF_Pos)           /* (SDMMC_CA0R) Timeout Clock Frequency Mask */
#define SDMMC_CA0R_TEOCLKF(value)             (SDMMC_CA0R_TEOCLKF_Msk & (_UINT32_(value) << SDMMC_CA0R_TEOCLKF_Pos)) /* Assigment of value for TEOCLKF in the SDMMC_CA0R register */
#define   SDMMC_CA0R_TEOCLKF_OTHER_Val        _UINT32_(0x0)                                        /* (SDMMC_CA0R) Get information via another method  */
#define SDMMC_CA0R_TEOCLKF_OTHER              (SDMMC_CA0R_TEOCLKF_OTHER_Val << SDMMC_CA0R_TEOCLKF_Pos) /* (SDMMC_CA0R) Get information via another method Position  */
#define SDMMC_CA0R_TEOCLKU_Pos                _UINT32_(7)                                          /* (SDMMC_CA0R) Timeout Clock Unit Position */
#define SDMMC_CA0R_TEOCLKU_Msk                (_UINT32_(0x1) << SDMMC_CA0R_TEOCLKU_Pos)            /* (SDMMC_CA0R) Timeout Clock Unit Mask */
#define SDMMC_CA0R_TEOCLKU(value)             (SDMMC_CA0R_TEOCLKU_Msk & (_UINT32_(value) << SDMMC_CA0R_TEOCLKU_Pos)) /* Assigment of value for TEOCLKU in the SDMMC_CA0R register */
#define   SDMMC_CA0R_TEOCLKU_KHZ_Val          _UINT32_(0x0)                                        /* (SDMMC_CA0R) KHz  */
#define   SDMMC_CA0R_TEOCLKU_MHZ_Val          _UINT32_(0x1)                                        /* (SDMMC_CA0R) MHz  */
#define SDMMC_CA0R_TEOCLKU_KHZ                (SDMMC_CA0R_TEOCLKU_KHZ_Val << SDMMC_CA0R_TEOCLKU_Pos) /* (SDMMC_CA0R) KHz Position  */
#define SDMMC_CA0R_TEOCLKU_MHZ                (SDMMC_CA0R_TEOCLKU_MHZ_Val << SDMMC_CA0R_TEOCLKU_Pos) /* (SDMMC_CA0R) MHz Position  */
#define SDMMC_CA0R_BASECLKF_Pos               _UINT32_(8)                                          /* (SDMMC_CA0R) Base Clock Frequency Position */
#define SDMMC_CA0R_BASECLKF_Msk               (_UINT32_(0xFF) << SDMMC_CA0R_BASECLKF_Pos)          /* (SDMMC_CA0R) Base Clock Frequency Mask */
#define SDMMC_CA0R_BASECLKF(value)            (SDMMC_CA0R_BASECLKF_Msk & (_UINT32_(value) << SDMMC_CA0R_BASECLKF_Pos)) /* Assigment of value for BASECLKF in the SDMMC_CA0R register */
#define   SDMMC_CA0R_BASECLKF_OTHER_Val       _UINT32_(0x0)                                        /* (SDMMC_CA0R) Get information via another method  */
#define SDMMC_CA0R_BASECLKF_OTHER             (SDMMC_CA0R_BASECLKF_OTHER_Val << SDMMC_CA0R_BASECLKF_Pos) /* (SDMMC_CA0R) Get information via another method Position  */
#define SDMMC_CA0R_MAXBLKL_Pos                _UINT32_(16)                                         /* (SDMMC_CA0R) Max Block Length Position */
#define SDMMC_CA0R_MAXBLKL_Msk                (_UINT32_(0x3) << SDMMC_CA0R_MAXBLKL_Pos)            /* (SDMMC_CA0R) Max Block Length Mask */
#define SDMMC_CA0R_MAXBLKL(value)             (SDMMC_CA0R_MAXBLKL_Msk & (_UINT32_(value) << SDMMC_CA0R_MAXBLKL_Pos)) /* Assigment of value for MAXBLKL in the SDMMC_CA0R register */
#define   SDMMC_CA0R_MAXBLKL_512_Val          _UINT32_(0x0)                                        /* (SDMMC_CA0R) 512 bytes  */
#define   SDMMC_CA0R_MAXBLKL_1024_Val         _UINT32_(0x1)                                        /* (SDMMC_CA0R) 1024 bytes  */
#define   SDMMC_CA0R_MAXBLKL_2048_Val         _UINT32_(0x2)                                        /* (SDMMC_CA0R) 2048 bytes  */
#define SDMMC_CA0R_MAXBLKL_512                (SDMMC_CA0R_MAXBLKL_512_Val << SDMMC_CA0R_MAXBLKL_Pos) /* (SDMMC_CA0R) 512 bytes Position  */
#define SDMMC_CA0R_MAXBLKL_1024               (SDMMC_CA0R_MAXBLKL_1024_Val << SDMMC_CA0R_MAXBLKL_Pos) /* (SDMMC_CA0R) 1024 bytes Position  */
#define SDMMC_CA0R_MAXBLKL_2048               (SDMMC_CA0R_MAXBLKL_2048_Val << SDMMC_CA0R_MAXBLKL_Pos) /* (SDMMC_CA0R) 2048 bytes Position  */
#define SDMMC_CA0R_ED8SUP_Pos                 _UINT32_(18)                                         /* (SDMMC_CA0R) 8-bit Support for Embedded Device Position */
#define SDMMC_CA0R_ED8SUP_Msk                 (_UINT32_(0x1) << SDMMC_CA0R_ED8SUP_Pos)             /* (SDMMC_CA0R) 8-bit Support for Embedded Device Mask */
#define SDMMC_CA0R_ED8SUP(value)              (SDMMC_CA0R_ED8SUP_Msk & (_UINT32_(value) << SDMMC_CA0R_ED8SUP_Pos)) /* Assigment of value for ED8SUP in the SDMMC_CA0R register */
#define   SDMMC_CA0R_ED8SUP_NO_Val            _UINT32_(0x0)                                        /* (SDMMC_CA0R) 8-bit Bus Width not Supported  */
#define   SDMMC_CA0R_ED8SUP_YES_Val           _UINT32_(0x1)                                        /* (SDMMC_CA0R) 8-bit Bus Width Supported  */
#define SDMMC_CA0R_ED8SUP_NO                  (SDMMC_CA0R_ED8SUP_NO_Val << SDMMC_CA0R_ED8SUP_Pos)  /* (SDMMC_CA0R) 8-bit Bus Width not Supported Position  */
#define SDMMC_CA0R_ED8SUP_YES                 (SDMMC_CA0R_ED8SUP_YES_Val << SDMMC_CA0R_ED8SUP_Pos) /* (SDMMC_CA0R) 8-bit Bus Width Supported Position  */
#define SDMMC_CA0R_ADMA2SUP_Pos               _UINT32_(19)                                         /* (SDMMC_CA0R) ADMA2 Support Position */
#define SDMMC_CA0R_ADMA2SUP_Msk               (_UINT32_(0x1) << SDMMC_CA0R_ADMA2SUP_Pos)           /* (SDMMC_CA0R) ADMA2 Support Mask */
#define SDMMC_CA0R_ADMA2SUP(value)            (SDMMC_CA0R_ADMA2SUP_Msk & (_UINT32_(value) << SDMMC_CA0R_ADMA2SUP_Pos)) /* Assigment of value for ADMA2SUP in the SDMMC_CA0R register */
#define   SDMMC_CA0R_ADMA2SUP_NO_Val          _UINT32_(0x0)                                        /* (SDMMC_CA0R) ADMA2 not Supported  */
#define   SDMMC_CA0R_ADMA2SUP_YES_Val         _UINT32_(0x1)                                        /* (SDMMC_CA0R) ADMA2 Supported  */
#define SDMMC_CA0R_ADMA2SUP_NO                (SDMMC_CA0R_ADMA2SUP_NO_Val << SDMMC_CA0R_ADMA2SUP_Pos) /* (SDMMC_CA0R) ADMA2 not Supported Position  */
#define SDMMC_CA0R_ADMA2SUP_YES               (SDMMC_CA0R_ADMA2SUP_YES_Val << SDMMC_CA0R_ADMA2SUP_Pos) /* (SDMMC_CA0R) ADMA2 Supported Position  */
#define SDMMC_CA0R_HSSUP_Pos                  _UINT32_(21)                                         /* (SDMMC_CA0R) High Speed Support Position */
#define SDMMC_CA0R_HSSUP_Msk                  (_UINT32_(0x1) << SDMMC_CA0R_HSSUP_Pos)              /* (SDMMC_CA0R) High Speed Support Mask */
#define SDMMC_CA0R_HSSUP(value)               (SDMMC_CA0R_HSSUP_Msk & (_UINT32_(value) << SDMMC_CA0R_HSSUP_Pos)) /* Assigment of value for HSSUP in the SDMMC_CA0R register */
#define   SDMMC_CA0R_HSSUP_NO_Val             _UINT32_(0x0)                                        /* (SDMMC_CA0R) High Speed not Supported  */
#define   SDMMC_CA0R_HSSUP_YES_Val            _UINT32_(0x1)                                        /* (SDMMC_CA0R) High Speed Supported  */
#define SDMMC_CA0R_HSSUP_NO                   (SDMMC_CA0R_HSSUP_NO_Val << SDMMC_CA0R_HSSUP_Pos)    /* (SDMMC_CA0R) High Speed not Supported Position  */
#define SDMMC_CA0R_HSSUP_YES                  (SDMMC_CA0R_HSSUP_YES_Val << SDMMC_CA0R_HSSUP_Pos)   /* (SDMMC_CA0R) High Speed Supported Position  */
#define SDMMC_CA0R_SDMASUP_Pos                _UINT32_(22)                                         /* (SDMMC_CA0R) SDMA Support Position */
#define SDMMC_CA0R_SDMASUP_Msk                (_UINT32_(0x1) << SDMMC_CA0R_SDMASUP_Pos)            /* (SDMMC_CA0R) SDMA Support Mask */
#define SDMMC_CA0R_SDMASUP(value)             (SDMMC_CA0R_SDMASUP_Msk & (_UINT32_(value) << SDMMC_CA0R_SDMASUP_Pos)) /* Assigment of value for SDMASUP in the SDMMC_CA0R register */
#define   SDMMC_CA0R_SDMASUP_NO_Val           _UINT32_(0x0)                                        /* (SDMMC_CA0R) SDMA not Supported  */
#define   SDMMC_CA0R_SDMASUP_YES_Val          _UINT32_(0x1)                                        /* (SDMMC_CA0R) SDMA Supported  */
#define SDMMC_CA0R_SDMASUP_NO                 (SDMMC_CA0R_SDMASUP_NO_Val << SDMMC_CA0R_SDMASUP_Pos) /* (SDMMC_CA0R) SDMA not Supported Position  */
#define SDMMC_CA0R_SDMASUP_YES                (SDMMC_CA0R_SDMASUP_YES_Val << SDMMC_CA0R_SDMASUP_Pos) /* (SDMMC_CA0R) SDMA Supported Position  */
#define SDMMC_CA0R_SRSUP_Pos                  _UINT32_(23)                                         /* (SDMMC_CA0R) Suspend/Resume Support Position */
#define SDMMC_CA0R_SRSUP_Msk                  (_UINT32_(0x1) << SDMMC_CA0R_SRSUP_Pos)              /* (SDMMC_CA0R) Suspend/Resume Support Mask */
#define SDMMC_CA0R_SRSUP(value)               (SDMMC_CA0R_SRSUP_Msk & (_UINT32_(value) << SDMMC_CA0R_SRSUP_Pos)) /* Assigment of value for SRSUP in the SDMMC_CA0R register */
#define   SDMMC_CA0R_SRSUP_NO_Val             _UINT32_(0x0)                                        /* (SDMMC_CA0R) Suspend/Resume not Supported  */
#define   SDMMC_CA0R_SRSUP_YES_Val            _UINT32_(0x1)                                        /* (SDMMC_CA0R) Suspend/Resume Supported  */
#define SDMMC_CA0R_SRSUP_NO                   (SDMMC_CA0R_SRSUP_NO_Val << SDMMC_CA0R_SRSUP_Pos)    /* (SDMMC_CA0R) Suspend/Resume not Supported Position  */
#define SDMMC_CA0R_SRSUP_YES                  (SDMMC_CA0R_SRSUP_YES_Val << SDMMC_CA0R_SRSUP_Pos)   /* (SDMMC_CA0R) Suspend/Resume Supported Position  */
#define SDMMC_CA0R_V33VSUP_Pos                _UINT32_(24)                                         /* (SDMMC_CA0R) Voltage Support 3.3V Position */
#define SDMMC_CA0R_V33VSUP_Msk                (_UINT32_(0x1) << SDMMC_CA0R_V33VSUP_Pos)            /* (SDMMC_CA0R) Voltage Support 3.3V Mask */
#define SDMMC_CA0R_V33VSUP(value)             (SDMMC_CA0R_V33VSUP_Msk & (_UINT32_(value) << SDMMC_CA0R_V33VSUP_Pos)) /* Assigment of value for V33VSUP in the SDMMC_CA0R register */
#define   SDMMC_CA0R_V33VSUP_NO_Val           _UINT32_(0x0)                                        /* (SDMMC_CA0R) 3.3V Not Supported  */
#define   SDMMC_CA0R_V33VSUP_YES_Val          _UINT32_(0x1)                                        /* (SDMMC_CA0R) 3.3V Supported  */
#define SDMMC_CA0R_V33VSUP_NO                 (SDMMC_CA0R_V33VSUP_NO_Val << SDMMC_CA0R_V33VSUP_Pos) /* (SDMMC_CA0R) 3.3V Not Supported Position  */
#define SDMMC_CA0R_V33VSUP_YES                (SDMMC_CA0R_V33VSUP_YES_Val << SDMMC_CA0R_V33VSUP_Pos) /* (SDMMC_CA0R) 3.3V Supported Position  */
#define SDMMC_CA0R_V30VSUP_Pos                _UINT32_(25)                                         /* (SDMMC_CA0R) Voltage Support 3.0V Position */
#define SDMMC_CA0R_V30VSUP_Msk                (_UINT32_(0x1) << SDMMC_CA0R_V30VSUP_Pos)            /* (SDMMC_CA0R) Voltage Support 3.0V Mask */
#define SDMMC_CA0R_V30VSUP(value)             (SDMMC_CA0R_V30VSUP_Msk & (_UINT32_(value) << SDMMC_CA0R_V30VSUP_Pos)) /* Assigment of value for V30VSUP in the SDMMC_CA0R register */
#define   SDMMC_CA0R_V30VSUP_NO_Val           _UINT32_(0x0)                                        /* (SDMMC_CA0R) 3.0V Not Supported  */
#define   SDMMC_CA0R_V30VSUP_YES_Val          _UINT32_(0x1)                                        /* (SDMMC_CA0R) 3.0V Supported  */
#define SDMMC_CA0R_V30VSUP_NO                 (SDMMC_CA0R_V30VSUP_NO_Val << SDMMC_CA0R_V30VSUP_Pos) /* (SDMMC_CA0R) 3.0V Not Supported Position  */
#define SDMMC_CA0R_V30VSUP_YES                (SDMMC_CA0R_V30VSUP_YES_Val << SDMMC_CA0R_V30VSUP_Pos) /* (SDMMC_CA0R) 3.0V Supported Position  */
#define SDMMC_CA0R_V18VSUP_Pos                _UINT32_(26)                                         /* (SDMMC_CA0R) Voltage Support 1.8V Position */
#define SDMMC_CA0R_V18VSUP_Msk                (_UINT32_(0x1) << SDMMC_CA0R_V18VSUP_Pos)            /* (SDMMC_CA0R) Voltage Support 1.8V Mask */
#define SDMMC_CA0R_V18VSUP(value)             (SDMMC_CA0R_V18VSUP_Msk & (_UINT32_(value) << SDMMC_CA0R_V18VSUP_Pos)) /* Assigment of value for V18VSUP in the SDMMC_CA0R register */
#define   SDMMC_CA0R_V18VSUP_NO_Val           _UINT32_(0x0)                                        /* (SDMMC_CA0R) 1.8V Not Supported  */
#define   SDMMC_CA0R_V18VSUP_YES_Val          _UINT32_(0x1)                                        /* (SDMMC_CA0R) 1.8V Supported  */
#define SDMMC_CA0R_V18VSUP_NO                 (SDMMC_CA0R_V18VSUP_NO_Val << SDMMC_CA0R_V18VSUP_Pos) /* (SDMMC_CA0R) 1.8V Not Supported Position  */
#define SDMMC_CA0R_V18VSUP_YES                (SDMMC_CA0R_V18VSUP_YES_Val << SDMMC_CA0R_V18VSUP_Pos) /* (SDMMC_CA0R) 1.8V Supported Position  */
#define SDMMC_CA0R_SB64SUP_Pos                _UINT32_(28)                                         /* (SDMMC_CA0R) 64-Bit System Bus Support Position */
#define SDMMC_CA0R_SB64SUP_Msk                (_UINT32_(0x1) << SDMMC_CA0R_SB64SUP_Pos)            /* (SDMMC_CA0R) 64-Bit System Bus Support Mask */
#define SDMMC_CA0R_SB64SUP(value)             (SDMMC_CA0R_SB64SUP_Msk & (_UINT32_(value) << SDMMC_CA0R_SB64SUP_Pos)) /* Assigment of value for SB64SUP in the SDMMC_CA0R register */
#define   SDMMC_CA0R_SB64SUP_NO_Val           _UINT32_(0x0)                                        /* (SDMMC_CA0R) 32-bit Address Descriptors and System Bus  */
#define   SDMMC_CA0R_SB64SUP_YES_Val          _UINT32_(0x1)                                        /* (SDMMC_CA0R) 64-bit Address Descriptors and System Bus  */
#define SDMMC_CA0R_SB64SUP_NO                 (SDMMC_CA0R_SB64SUP_NO_Val << SDMMC_CA0R_SB64SUP_Pos) /* (SDMMC_CA0R) 32-bit Address Descriptors and System Bus Position  */
#define SDMMC_CA0R_SB64SUP_YES                (SDMMC_CA0R_SB64SUP_YES_Val << SDMMC_CA0R_SB64SUP_Pos) /* (SDMMC_CA0R) 64-bit Address Descriptors and System Bus Position  */
#define SDMMC_CA0R_ASINTSUP_Pos               _UINT32_(29)                                         /* (SDMMC_CA0R) Asynchronous Interrupt Support Position */
#define SDMMC_CA0R_ASINTSUP_Msk               (_UINT32_(0x1) << SDMMC_CA0R_ASINTSUP_Pos)           /* (SDMMC_CA0R) Asynchronous Interrupt Support Mask */
#define SDMMC_CA0R_ASINTSUP(value)            (SDMMC_CA0R_ASINTSUP_Msk & (_UINT32_(value) << SDMMC_CA0R_ASINTSUP_Pos)) /* Assigment of value for ASINTSUP in the SDMMC_CA0R register */
#define   SDMMC_CA0R_ASINTSUP_NO_Val          _UINT32_(0x0)                                        /* (SDMMC_CA0R) Asynchronous Interrupt not Supported  */
#define   SDMMC_CA0R_ASINTSUP_YES_Val         _UINT32_(0x1)                                        /* (SDMMC_CA0R) Asynchronous Interrupt supported  */
#define SDMMC_CA0R_ASINTSUP_NO                (SDMMC_CA0R_ASINTSUP_NO_Val << SDMMC_CA0R_ASINTSUP_Pos) /* (SDMMC_CA0R) Asynchronous Interrupt not Supported Position  */
#define SDMMC_CA0R_ASINTSUP_YES               (SDMMC_CA0R_ASINTSUP_YES_Val << SDMMC_CA0R_ASINTSUP_Pos) /* (SDMMC_CA0R) Asynchronous Interrupt supported Position  */
#define SDMMC_CA0R_SLTYPE_Pos                 _UINT32_(30)                                         /* (SDMMC_CA0R) Slot Type Position */
#define SDMMC_CA0R_SLTYPE_Msk                 (_UINT32_(0x3) << SDMMC_CA0R_SLTYPE_Pos)             /* (SDMMC_CA0R) Slot Type Mask */
#define SDMMC_CA0R_SLTYPE(value)              (SDMMC_CA0R_SLTYPE_Msk & (_UINT32_(value) << SDMMC_CA0R_SLTYPE_Pos)) /* Assigment of value for SLTYPE in the SDMMC_CA0R register */
#define   SDMMC_CA0R_SLTYPE_REMOVABLE_Val     _UINT32_(0x0)                                        /* (SDMMC_CA0R) Removable Card Slot  */
#define   SDMMC_CA0R_SLTYPE_EMBEDDED_Val      _UINT32_(0x1)                                        /* (SDMMC_CA0R) Embedded Slot for One Device  */
#define SDMMC_CA0R_SLTYPE_REMOVABLE           (SDMMC_CA0R_SLTYPE_REMOVABLE_Val << SDMMC_CA0R_SLTYPE_Pos) /* (SDMMC_CA0R) Removable Card Slot Position  */
#define SDMMC_CA0R_SLTYPE_EMBEDDED            (SDMMC_CA0R_SLTYPE_EMBEDDED_Val << SDMMC_CA0R_SLTYPE_Pos) /* (SDMMC_CA0R) Embedded Slot for One Device Position  */
#define SDMMC_CA0R_Msk                        _UINT32_(0xF7EFFFBF)                                 /* (SDMMC_CA0R) Register Mask  */


/* -------- SDMMC_CA1R : (SDMMC Offset: 0x44) (R/W 32) Capabilities 1 -------- */
#define SDMMC_CA1R_RESETVALUE                 _UINT32_(0x10070)                                    /*  (SDMMC_CA1R) Capabilities 1  Reset Value */

